#pragma once

//技情報
struct Move {
	char move_name[50];		//技の名前
	char move_exp[200];
	int att_point;			//相手に与えるダメージ
	int myself_att;
	int DP_cons;			//技使用時に消費するDP
};

//プレイヤー情報
struct Player {

	int HP;		//現在のHP
	int HP_MAX;	//HPの最大値
	int DP;		//現在のDP
	int DP_MAX;	//DPの最大値

	struct Move m[6];		//1～6の目の技
	int gold;			//所持ゴールド
	int exp;			//現在の経験値
	int max_exp;		//次のレベルまでの必要経験値
};

//モンスター情報
struct Monster {
	char monster_name[50];	//モンスターの名前

	int HP;		//現在のHP
	int HP_MAX;	//HPの最大値
	int DP;		//現在のDP
	int DP_MAX;	//DPの最大値

	struct Move m[6];		//1～6の目の技

	int gold;			//敵が落とすゴールド
	int exp;			//敵から得られる経験値
};

extern int num = 0;

//ショップリスト
extern Move shop_move[5] = {
	{ "ひっかく", "相手に5ダメージ、DP+5", 5, 0, -5 },
	{ "きりさく", "相手に7ダメージ、DP+5", 7, 0, -5 },
	{ "グングニル", "相手に12ダメージ", 12, 0, 5 },
	{ "ベギラゴン", "相手に50ダメージ与え、自分にも10ダメージ", 50, 10, -3 },
	{ "ジ・アース", "相手に100ダメージ", 100, 0, 5 },
};

extern int s[5]{
	200, 500, 1000, 5000, 9999
};

//プレイヤーの初期技
extern Move move0[6] = {
	{ "やすむ", "休んで、DPを3ためる", 0, 0, -3 },
	{ "パンチ", "相手に1ダメージ", 1, 0, 0 },
	{ "やすむ", "休んで、DPを3ためる", 0, 0, -3 },
	{ "パンチ", "相手に1ダメージ", 1, 0, 0  },
	{ "やすむ", "休んで、DPを3ためる", 0, 0, -3 },
	{ "フルパンチ", "相手に出た目+3のダメージ", num + 3, 0, 9  }
};

extern int count = 3;
//
extern Move moveList[50]{
	{ "やすむ", "休んで、DPを3ためる", 0, 0, -3 },
	{ "パンチ", "相手に1ダメージ", 1, 0, 0 },
	{ "フルパンチ", "相手に出た目+3のダメージ", num + 3, 0, 9  }
};

//モンスター1の技リスト
extern Move move1[6] = {
	{ "なにもしない", "なにもせず、DPを５ためる", 0, 0, -5 },
	{ "なにもしない", "なにもせず、DPを５ためる", 0, 0, -5 },
	{ "なにもしない", "なにもせず、DPを５ためる", 0, 0, -5 },
	{ "体当たり", "相手に出た目+1のダメージを与え、自分にも2ダメージ、DP+2", num + 1, 2, -2 },
	{ "打撃", "相手に出た目のダメージ、DP+1", num, 0, -1 },
	{ "打撃", "相手に出た目のダメージ、DP+1", num, 0, -1 }
};

extern Move move2[6] = {
	{ "なにもしない", "なにもせず、DPを５ためる", 0, 0, -5 },
	{ "打撃", "相手に出た目のダメージ、DP+1", num, 0, -1 },
	{ "なにもしない", "なにもせず、DPを５ためる", 0, 0, -5 },
	{ "体当たり", "相手に出た目+1のダメージを与え、自分にも2ダメージ、DP+2", num + 1, 2, -2 },
	{ "息を吐く", "相手に２ダメージ", 2, 0, -5 },
	{ "なにもしない", "なにもせず、DPを５ためる", 0, 0, -5 }
};

extern Move move3[6] = {
	{ "まるくなる", "まるくなり、DPを3ためる", 0, 0, -3 },
	{"まるくなる", "まるくなり、DPを3ためる", 0, 0, -3 },
	{ "ころがる", "相手に3のダメージを与え、自分にも1ダメージ", 3, 1, 3},
	{ "大車輪", "相手に出た目×3のダメージを与え、自分にも出た目×2のダメージ", num * 3, num * 2, 5 },
	{ "ころがる", "相手に3のダメージを与え、自分にも1ダメージ", 3, 1, 3  },
	{ "まるくなる", "まるくなり、DPを3ためる", 0, 0, -3 }
};

extern Move move4[6] = {
	{ "たたく", "相手に2ダメージ、DP+1", 0, 0, -1 },
	{ "たたく", "相手に2ダメージ、DP+1", 0, 0, -1 },
	{ "たたく", "相手に2ダメージ、DP+1", 0, 0, -1},
	{ "たたく", "相手に2ダメージ、DP+1", 0, 0, -1 },
	{ "たたく", "相手に2ダメージ、DP+1", 0, 0, -1  },
	{ "たたきつける", "相手に5ダメージ", num * 2, 0, 3 }
};

extern Move move5[6] = {
	{ "なにもしない", "なにもせず、DPを５ためる", 0, 0, -5 },
	{ "なにもしない", "なにもせず、DPを５ためる", 0, 0, -5 },
	{ "なにもしない", "なにもせず、DPを５ためる", 0, 0, -5 },
	{ "体当たり", "相手に出た目+1のダメージを与え、自分にも2ダメージ、DP+2", num + 1, 2, -2 },
	{ "打撃", "相手に出た目のダメージ、DP+1", num, 0, -1 },
	{ "打撃", "相手に出た目のダメージ、DP+1", num, 0, -1 }
};

extern Move move6[6] = {
	{ "なにもしない", "なにもせず、DPを５ためる", 0, 0, -5 },
	{ "打撃", "相手に出た目のダメージ、DP+1", num, 0, -1 },
	{ "なにもしない", "なにもせず、DPを５ためる", 0, 0, -5 },
	{ "体当たり", "相手に出た目+1のダメージを与え、自分にも2ダメージ、DP+2", num + 1, 2, -2 },
	{ "息を吐く", "相手に２ダメージ", 2, 0, -5 },
	{ "なにもしない", "なにもせず、DPを５ためる", 0, 0, -5 }
};

extern Move move7[6] = {
	{ "精神統一", "精神を統一させ、DPを7ためる", 0, 0, -7 },
	{ "切りかかる", "相手に出た目+2のダメージ", num + 2, 0, 3 },
	{ "切りかかる", "相手に出た目+2のダメージ", num + 2, 0, 3},
	{ "体当たり", "相手に出た目+1のダメージを与え、自分にも2ダメージ、DP+2", num + 1, 2, -2 },
	{ "精神統一", "精神を統一させ、DPを7ためる", 0, 0, -7  },
	{ "魔人切り", "相手に出た目×2のダメージ", num * 2, 0, 15 }
};

extern Move move8[6] = {
	{ "たたく", "相手に2ダメージ、DP+1", 0, 0, -1 },
	{ "たたく", "相手に2ダメージ、DP+1", 0, 0, -1 },
	{ "たたく", "相手に2ダメージ、DP+1", 0, 0, -1},
	{ "たたく", "相手に2ダメージ、DP+1", 0, 0, -1 },
	{ "たたく", "相手に2ダメージ、DP+1", 0, 0, -1  },
	{ "たたきつける", "相手に5ダメージ", num * 2, 0, 3 }
};

//ボス技
extern Move boss_move1[6] = {
	{ "なにもしない", "なにもせず、DPを５ためる", 0, 0, -5 },
	{ "なにもしない", "なにもせず、DPを５ためる", 0, 0, -5 },
	{ "なにもしない", "なにもせず、DPを５ためる", 0, 0, -5 },
	{ "体当たり", "相手に出た目+1のダメージを与え、自分にも2ダメージ、DP+2", num + 1, 2, -2 },
	{ "打撃", "相手に出た目のダメージ、DP+1", num, 0, -1 },
	{ "打撃", "相手に出た目のダメージ、DP+1", num, 0, -1 }
};

extern Move boss_move2[6] = {
	{ "なにもしない", "なにもせず、DPを５ためる", 0, 0, -5 },
	{ "打撃", "相手に出た目のダメージ、DP+1", num, 0, -1 },
	{ "なにもしない", "なにもせず、DPを５ためる", 0, 0, -5 },
	{ "体当たり", "相手に出た目+1のダメージを与え、自分にも2ダメージ、DP+2", num + 1, 2, -2 },
	{ "息を吐く", "相手に２ダメージ", 2, 0, -5 },
	{ "なにもしない", "なにもせず、DPを５ためる", 0, 0, -5 }
};

extern Move boss_move3[6] = {
	{ "まるくなる", "まるくなり、DPを3ためる", 0, 0, -3 },
	{"まるくなる", "まるくなり、DPを3ためる", 0, 0, -3 },
	{ "ころがる", "相手に3のダメージを与え、自分にも1ダメージ", 3, 1, 3},
	{ "大車輪", "相手に出た目×3のダメージを与え、自分にも出た目×2のダメージ", num * 3, num * 2, 5 },
	{ "ころがる", "相手に3のダメージを与え、自分にも1ダメージ", 3, 1, 3  },
	{ "まるくなる", "まるくなり、DPを3ためる", 0, 0, -3 }
};

extern Move boss_move4[6] = {
	{ "たたく", "相手に2ダメージ、DP+1", 0, 0, -1 },
	{ "たたく", "相手に2ダメージ、DP+1", 0, 0, -1 },
	{ "たたく", "相手に2ダメージ、DP+1", 0, 0, -1},
	{ "たたく", "相手に2ダメージ、DP+1", 0, 0, -1 },
	{ "たたく", "相手に2ダメージ、DP+1", 0, 0, -1  },
	{ "たたきつける", "相手に5ダメージ", num * 2, 0, 3 }
};

extern Move boss_move5[6] = {
	{ "なにもしない", "なにもせず、DPを５ためる", 0, 0, -5 },
	{ "なにもしない", "なにもせず、DPを５ためる", 0, 0, -5 },
	{ "なにもしない", "なにもせず、DPを５ためる", 0, 0, -5 },
	{ "体当たり", "相手に出た目+1のダメージを与え、自分にも2ダメージ、DP+2", num + 1, 2, -2 },
	{ "打撃", "相手に出た目のダメージ、DP+1", num, 0, -1 },
	{ "打撃", "相手に出た目のダメージ、DP+1", num, 0, -1 }
};

extern Move boss_move6[6] = {
	{ "なにもしない", "なにもせず、DPを５ためる", 0, 0, -5 },
	{ "打撃", "相手に出た目のダメージ、DP+1", num, 0, -1 },
	{ "なにもしない", "なにもせず、DPを５ためる", 0, 0, -5 },
	{ "体当たり", "相手に出た目+1のダメージを与え、自分にも2ダメージ、DP+2", num + 1, 2, -2 },
	{ "息を吐く", "相手に２ダメージ", 2, 0, -5 },
	{ "なにもしない", "なにもせず、DPを５ためる", 0, 0, -5 }
};

//プレイヤー設定
extern struct Player p = { 15, 15, 15, 15, move0[1], move0[1], move0[2], move0[3], move0[4], move0[5], 10000, 0};

//ゴーレムの館出現モンスター
extern struct Monster G[8] = {
	{ "スライム", 10, 10, 10, 10, move1[0], move1[1], move1[2], move1[3], move1[4], move1[5], 10, 10 },		
	{ "ドラキー", 12, 12, 15, 15, move2[0], move2[1], move2[2], move2[3], move2[4], move2[5], 12, 12 },		
	{ "たまたま", 13, 13, 10, 10, move3[0], move3[1], move3[2], move3[3], move3[4], move3[5], 15, 8 },		
	{ "おおもぐら", 15, 15, 5, 5, move4[0], move4[1], move4[2], move4[3], move4[4], move4[5], 10, 15 },		
	{ "おどるほうせき", 20, 20, 27, 27, move5[0], move5[1], move5[2], move5[3], move5[4], move5[5], 360, 1 },		
	{ "ダークエルフ", 10, 10, 20, 20, move6[0], move6[1], move6[2], move6[3], move6[4], move6[5], 10, 16 },		
	{ "スライムナイト", 15, 15, 10, 10, move7[0], move7[1], move7[2], move7[3], move7[4], move7[5], 18, 20 },		
	{ "プチゴーレム", 30, 30, 8, 8, move8[0], move8[1], move8[2], move8[3], move8[4], move8[5], 30, 30 },		
};


//トンボの巣出現モンスター
extern struct Monster T[8] = {
	{ "クワガタン", 10, 10, 10, 10, move1[0], move1[1], move1[2], move1[3], move1[4], move1[5], 10, 10 },
	{ "カブトン", 12, 12, 15, 15, move2[0], move2[1], move2[2], move2[3], move2[4], move2[5], 10, 10 },
	{ "ウラガエル", 15, 15, 10, 10, move3[0], move3[1], move3[2], move3[3], move3[4], move3[5], 10, 10 },
	{ "おおもぐら", 20, 20, 5, 5, move4[0], move4[1], move4[2], move4[3], move4[4], move4[5], 10, 10 },
	{ "スライム", 10, 10, 10, 10, move5[0], move5[1], move5[2], move5[3], move5[4], move5[5], 10, 10 },
	{ "ダークエルフ", 10, 10, 20, 20, move6[0], move6[1], move6[2], move6[3], move6[4], move6[5], 10, 10 },
	{ "修行厨", 37, 37, 10, 10, move7[0], move7[1], move7[2], move7[3], move7[4], move7[5], 10, 10 },
	{ "ヘラクレン", 40, 40, 5, 5, move8[0], move8[1], move8[2], move8[3], move8[4], move8[5], 10, 10 },
};

//ゴーレムの館bossモンスター
extern struct Monster G_BOSS = { "キングゴーレム", 100, 100, 10, 10, boss_move1[0], boss_move1[1], boss_move1[2], boss_move1[3], boss_move1[4], boss_move1[5], 500, 500 };

//トンボの巣bossモンスター
extern struct Monster T_BOSS = { "ゴッドオブTONBO", 10, 10, 10, 10, boss_move2[0], boss_move2[1], boss_move2[2], boss_move2[3], boss_move2[4], boss_move2[5], 10, 10 };

//四天王
extern struct Monster four_star[4] = {
	{ "クワガタン", 10, 10, 10, 10, boss_move3[0], boss_move3[1], boss_move3[2], boss_move3[3], boss_move3[4], boss_move3[5], 10, 10 },
	{ "カブトン", 12, 12, 15, 15, boss_move4[0], boss_move4[1], boss_move4[2], boss_move4[3], boss_move4[4], boss_move4[5], 10, 10 },
	{ "ウラガエル", 15, 15, 10, 10, boss_move5[0], boss_move5[1], boss_move5[2], boss_move5[3], boss_move5[4], boss_move5[5], 10, 10 },
	{ "おおもぐら", 20, 20, 5, 5, boss_move6[0], boss_move6[1], boss_move6[2], boss_move6[3], boss_move6[4], boss_move6[5], 10, 10 },
};





